==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN                                      [64, 10]                  --
├─Sequential: 1-1                        [64, 32, 2, 2]            --
│    └─Conv2d: 2-1                       [64, 128, 28, 28]         1,280
│    └─ReLU: 2-2                         [64, 128, 28, 28]         --
│    └─MaxPool2d: 2-3                    [64, 128, 14, 14]         --
│    └─Conv2d: 2-4                       [64, 64, 12, 12]          73,792
│    └─ReLU: 2-5                         [64, 64, 12, 12]          --
│    └─MaxPool2d: 2-6                    [64, 64, 6, 6]            --
│    └─Conv2d: 2-7                       [64, 32, 4, 4]            18,464
│    └─ReLU: 2-8                         [64, 32, 4, 4]            --
│    └─MaxPool2d: 2-9                    [64, 32, 2, 2]            --
├─Sequential: 1-2                        [64, 10]                  --
│    └─Flatten: 2-10                     [64, 128]                 --
│    └─Linear: 2-11                      [64, 64]                  8,256
│    └─ReLU: 2-12                        [64, 64]                  --
│    └─Linear: 2-13                      [64, 32]                  2,080
│    └─ReLU: 2-14                        [64, 32]                  --
│    └─Linear: 2-15                      [64, 10]                  330
==========================================================================================
Total params: 104,202
Trainable params: 104,202
Non-trainable params: 0
Total mult-adds (M): 763.88
==========================================================================================
Input size (MB): 0.20
Forward/backward pass size (MB): 56.42
Params size (MB): 0.42
Estimated Total Size (MB): 57.03
==========================================================================================