==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN_test1                                [64, 10]                  --
├─Sequential: 1-1                        [64, 16, 2, 2]            --
│    └─Conv2d: 2-1                       [64, 16, 28, 28]          160
│    └─ReLU: 2-2                         [64, 16, 28, 28]          --
│    └─MaxPool2d: 2-3                    [64, 16, 14, 14]          --
│    └─Conv2d: 2-4                       [64, 16, 12, 12]          2,320
│    └─ReLU: 2-5                         [64, 16, 12, 12]          --
│    └─MaxPool2d: 2-6                    [64, 16, 6, 6]            --
│    └─Conv2d: 2-7                       [64, 16, 4, 4]            2,320
│    └─ReLU: 2-8                         [64, 16, 4, 4]            --
│    └─MaxPool2d: 2-9                    [64, 16, 2, 2]            --
├─Sequential: 1-2                        [64, 10]                  --
│    └─Flatten: 2-10                     [64, 64]                  --
│    └─Linear: 2-11                      [64, 32]                  2,080
│    └─ReLU: 2-12                        [64, 32]                  --
│    └─Linear: 2-13                      [64, 10]                  330
==========================================================================================
Total params: 7,210
Trainable params: 7,210
Non-trainable params: 0
Total mult-adds (M): 31.94
==========================================================================================
Input size (MB): 0.20
Forward/backward pass size (MB): 7.75
Params size (MB): 0.03
Estimated Total Size (MB): 7.98
==========================================================================================