==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN_test3                                [64, 10]                  --
├─Sequential: 1-1                        [64, 128, 2, 2]           --
│    └─Conv2d: 2-1                       [64, 32, 28, 28]          320
│    └─ReLU: 2-2                         [64, 32, 28, 28]          --
│    └─MaxPool2d: 2-3                    [64, 32, 14, 14]          --
│    └─Conv2d: 2-4                       [64, 64, 12, 12]          18,496
│    └─ReLU: 2-5                         [64, 64, 12, 12]          --
│    └─MaxPool2d: 2-6                    [64, 64, 6, 6]            --
│    └─Conv2d: 2-7                       [64, 128, 4, 4]           73,856
│    └─ReLU: 2-8                         [64, 128, 4, 4]           --
│    └─MaxPool2d: 2-9                    [64, 128, 2, 2]           --
├─Sequential: 1-2                        [64, 10]                  --
│    └─Flatten: 2-10                     [64, 512]                 --
│    └─Linear: 2-11                      [64, 256]                 131,328
│    └─ReLU: 2-12                        [64, 256]                 --
│    └─Linear: 2-13                      [64, 128]                 32,896
│    └─ReLU: 2-14                        [64, 128]                 --
│    └─Linear: 2-15                      [64, 64]                  8,256
│    └─ReLU: 2-16                        [64, 64]                  --
│    └─Linear: 2-17                      [64, 32]                  2,080
│    └─ReLU: 2-18                        [64, 32]                  --
│    └─Linear: 2-19                      [64, 10]                  330
==========================================================================================
Total params: 267,562
Trainable params: 267,562
Non-trainable params: 0
Total mult-adds (M): 273.34
==========================================================================================
Input size (MB): 0.20
Forward/backward pass size (MB): 18.86
Params size (MB): 1.07
Estimated Total Size (MB): 20.13
==========================================================================================